willianchanlovegithub/DIY_projects_base_on_RT-Thread/DIY1/Fourth_week_mission/RECEIVE(stm32l475-atk-pandora)(SPI Flash)(RW007)/packages/nrf24l01-latest/src/nrf24l01.c
    temp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P3;
    hal_nrf24l01_port.send_then_send(&temp, 1, rp3_addr, 1);
}

static void set_tx_rp4_address5(void)
{
    uint8_t temp;
    uint8_t rp4_addr[1] = {0xC5};

    temp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P4;
    hal_nrf24l01_port.send_then_send(&temp, 1, rp4_addr, 1);
}

static void set_tx_rp5_address5(void)
{
    uint8_t temp;
    uint8_t rp5_addr[1] = {0xC6};

    temp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P5;
    hal_nrf24l01_port.send_then_send(&temp, 1, rp5_addr, 1);
}

void nrf24l01_multichannel(void)
{
    set_tx_rp1_address5();
    set_tx_rp2_address5();
    set_tx_rp3_address5();
    set_tx_rp4_address5();
    set_tx_rp5_address5();
    _set_reg_bits(NRF24REG_EN_AA, 0x3f);
    _set_reg_bits(NRF24REG_EN_RXADDR, 0x3f);
}

static void set_rf_channel(uint8_t channel)
{
    _write_reg(NRF24REG_RF_CH, channel & 0x7F);
}

static void set_air_data_rate(nrf24_adr_et adr)
{
    if (adr == ADR_1Mbps)
    {
        _reset_reg_bits(NRF24REG_RF_SETUP, NRF24BITMASK_RF_DR);
    }
    else if (adr == ADR_2Mbps)
    {
        _set_reg_bits(NRF24REG_RF_SETUP, NRF24BITMASK_RF_DR);
    }
}

static void set_rf_power(nrf24_power_et pa)
{
    if ((pa == RF_POWER_0dBm) ||
        (pa == RF_POWER_N6dBm) ||
        (pa == RF_POWER_N12dBm) ||
        (pa == RF_POWER_N18dBm))
    {
        _write_reg_bits(NRF24REG_RF_SETUP, NRF24BITMASK_RF_PWR, pa);
    }
}

static void _set_auto_retransmit_delay(uint8_t ard)
{
    _write_reg_bits(NRF24REG_SETUP_RETR, NRF24BITMASK_ARD, ard);
}

static void _set_auto_retransmit_count(uint8_t arc)
{
    _write_reg_bits(NRF24REG_SETUP_RETR, NRF24BITMASK_ARC, arc);
}

static void set_crc(nrf24_crc_et crc)
{
    if (crc == CRC_0_BYTE)
    {
        _reset_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_EN_CRC);
    }
    else
    {
        if (crc == CRC_1_BYTE)
        {
            _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_EN_CRC);
            _reset_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_CRCO);
        }
        else if (crc == CRC_2_BYTE)
        {
            _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_EN_CRC);
            _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_CRCO);
        }
    }
}

static void set_esb_param(nrf24_esb_t *pt)
{
    // avoid ARD equals 250us
    if (pt->ard == 0)
        pt->ard += 1;
    _set_auto_retransmit_delay(pt->ard);
    _set_auto_retransmit_count(pt->arc);
}

// bit: RX_DR, TX_DS, MAX_RT
static void reset_status(uint8_t bitmask)
{
    bitmask |= _read_reg(NRF24REG_STATUS);
    _write_reg(NRF24REG_STATUS, bitmask);
}

static void reset_observe_tx(void)
{
    _write_reg(NRF24REG_OBSERVE_TX, 0);
}

//[note] the NRF24CMD_R_RX_PL_WID command doesn't work?!
static uint8_t get_top_rxfifo_width(void)
{
    uint8_t temp = NRF24CMD_R_RX_PL_WID;

    hal_nrf24l01_port.send_then_recv(&temp, 1, &temp, 1);
    return temp;
}

// [note] enable activate-command befor enable_dpl
// pipe range: 0 ~ 5
// will also enable ENAA_PX to
static void enable_dpl_and_ackpayload(uint8_t pipe)
{
    if (pipe > 5)
        return;

    _set_reg_bits(NRF24REG_FEATURE, NRF24BITMASK_EN_ACK_PAY);
    _set_reg_bits(NRF24REG_FEATURE, NRF24BITMASK_EN_DPL);
    _set_reg_bits(NRF24REG_DYNPD, 0x3f);
}

static void enabled_irq(uint8_t bitmask)
{
    if (!((bitmask == NRF24BITMASK_RX_DR) || (bitmask == NRF24BITMASK_TX_DS) || (bitmask == NRF24BITMASK_MAX_RT)))
        return;

    _reset_reg_bits(NRF24REG_CONFIG, bitmask);
}

static void disable_irq(uint8_t bitmask)
{
    if (!((bitmask == NRF24BITMASK_RX_DR) || (bitmask == NRF24BITMASK_TX_DS) || (bitmask == NRF24BITMASK_MAX_RT)))
        return;

    _set_reg_bits(NRF24REG_CONFIG, bitmask);
}

static void write_tx_payload(const uint8_t *pb, uint8_t len)
{
    uint8_t temp = NRF24CMD_W_TX_PAYLOAD;

    hal_nrf24l01_port.send_then_send(&temp, 1, pb, len);
}

static void write_ack_payload(uint8_t pipe, const uint8_t *pb, uint8_t len)
{
    uint8_t temp;

    if (pipe > 5)
        return;

    temp = NRF24CMD_W_ACK_PAYLOAD | pipe;
    hal_nrf24l01_port.send_then_send(&temp, 1, pb, len);
}

static void read_rxpayload(uint8_t *pb, uint8_t len)
{
    uint8_t tcmd;

    if ((len > 32) || (len == 0))
        return;

    tcmd = NRF24CMD_R_RX_PAYLOAD;
    hal_nrf24l01_port.send_then_recv(&tcmd, 1, pb, len);
}

static void flush_tx_fifo(void)
{
    uint8_t temp = NRF24CMD_FLUSH_TX;

    hal_nrf24l01_port.write(&temp, 1);
}

static void flush_rx_fifo(void)
{
    uint8_t temp = NRF24CMD_FLUSH_RX;

    hal_nrf24l01_port.write(&temp, 1);
}

// note: will clear the error-counter
uint16_t nrf24_get_errcnt(void)
{
    uint16_t temp = l_error_count;
    l_error_count = 0;
    
    return temp;
}

void nrf24_power_up(void)
{
    _set_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PWR_UP);
}

void nrf24_power_down(void)
{
    _reset_reg_bits(NRF24REG_CONFIG, NRF24BITMASK_PWR_UP);
}

/**
 * @brief PTX(ROLE) run
 * @param[in] pb_tx: pointer of tx-buffer
 * @param[out] pb_rx: pointer of rx-buffer
 * @param tlen: size of pb_tx (by bytes)
 * @return Zero indicates sent complete but no data received;
 *         Negative number indicates error;
 *         Other indicates the number of bytes of received data, and indicates that sent is complete 
 * 
 * @attention Send data and then received data 
 */
int nrf24_ptx_run(uint8_t *pb_rx, const uint8_t *pb_tx, uint8_t tlen)
{
    uint8_t sta, trycnt = 0, rlen = 0;

    if (tlen > 32)
        return -6;

    write_tx_payload(pb_tx, tlen);

    hal_nrf24l01_port.set_ce();

    do
    {
        sta = _read_reg(NRF24REG_STATUS);
        if (sta & NRF24BITMASK_MAX_RT)
        {
            // send failed; try again
            reset_status(NRF24BITMASK_MAX_RT);

            if (++trycnt > 6)
            {
                hal_nrf24l01_port.reset_ce();
                flush_tx_fifo();
                reset_status(NRF24BITMASK_MAX_RT);

                l_error_count++;

                return -1;
            }
        }
    } while (!(sta & NRF24BITMASK_TX_DS));
    reset_status(NRF24BITMASK_TX_DS);

    if (sta & NRF24BITMASK_RX_DR)
    {
        reset_status(NRF24BITMASK_RX_DR);
        rlen = get_top_rxfifo_width();
        read_rxpayload(pb_rx, rlen);
    }

